running this without conditionals is working expected for me.

HCL 

<details>

```
```hcl
resource "cloudflare_ruleset" "http_request_cache_settings" {
  zone_id = var.zone_id
  name    = "default"
  kind    = "zone"
  phase   = "http_request_cache_settings"

  rules {
    action      = "set_cache_settings"
    description = "caching"
    enabled     = true
    expression  = "(http.request.full_uri eq \"https://example.com/path1\")"
    action_parameters {
      cache = false
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "caching2"
    enabled     = true
    expression  = "(http.host eq \"example.com\" and starts_with(http.request.uri.path, \"/path1\"))"
    action_parameters {
      cache = false
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "caching3"
    enabled     = true
    expression  = "(http.host eq \"example.com\" and http.request.uri.path eq \"/path1\")"
    action_parameters {
      cache = false
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "caching4"
    enabled     = true
    expression  = "(http.host eq \"example.com\" and http.request.uri.path eq \"/path1/path2\") or (http.host eq \"example.com\" and http.request.uri.path eq \"/path1/path2\")"
    action_parameters {
      cache = false
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "Disable cache for tunneled instances used for testing/dev"
    enabled     = true
    expression  = "(http.host in {\"example.com\" \"example.com\"})"
    action_parameters {
      cache = false
      browser_ttl {
        mode = "bypass"
      }
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "API cache"
    enabled     = true
    expression  = "(http.host in {\"example.com\" \"example.com\"} and http.request.uri.path matches \"^/path1/path2/path3\") or (http.host in {\"example.com\" \"example.com\"} and http.request.uri.path in {\"/path1/path2\"})"
    action_parameters {
      edge_ttl {
        mode = "respect_origin"
      }
      browser_ttl {
        mode = "respect_origin"
      }
    }
  }

  rules {
    action      = "set_cache_settings"
    description = "Homepage cache"
    enabled     = true
    expression  = "(http.host in {\"example1.com\" \"example2.com\"} and http.request.uri.path eq \"/\")"
    action_parameters {
      cache = true
    }
  }
}
```
</details>

Apply + plan 

<details>

```
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_ruleset.http_request_cache_settings will be created
  + resource "cloudflare_ruleset" "http_request_cache_settings" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "default"
      + phase       = "http_request_cache_settings"
      + zone_id     = "0da42c8d2132a9ddaf714f9e7c920711"

      + rules {
          + action       = "set_cache_settings"
          + description  = "caching"
          + enabled      = true
          + expression   = "(http.request.full_uri eq \"https://example.com/path1\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = false
              + version = (known after apply)
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "caching2"
          + enabled      = true
          + expression   = "(http.host eq \"example.com\" and starts_with(http.request.uri.path, \"/path1\"))"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = false
              + version = (known after apply)
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "caching3"
          + enabled      = true
          + expression   = "(http.host eq \"example.com\" and http.request.uri.path eq \"/path1\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = false
              + version = (known after apply)
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "caching4"
          + enabled      = true
          + expression   = "(http.host eq \"example.com\" and http.request.uri.path eq \"/path1/path2\") or (http.host eq \"example.com\" and http.request.uri.path eq \"/path1/path2\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = false
              + version = (known after apply)
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "Disable cache for tunneled instances used for testing/dev"
          + enabled      = true
          + expression   = "(http.host in {\"example.com\" \"example.com\"})"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = false
              + version = (known after apply)

              + browser_ttl {
                  + mode = "bypass"
                }
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "API cache"
          + enabled      = true
          + expression   = "(http.host in {\"example.com\" \"example.com\"} and http.request.uri.path matches \"^/path1/path2/path3\") or (http.host in {\"example.com\" \"example.com\"} and http.request.uri.path in {\"/path1/path2\"})"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + version = (known after apply)

              + browser_ttl {
                  + mode = "respect_origin"
                }

              + edge_ttl {
                  + mode = "respect_origin"
                }
            }
        }
      + rules {
          + action       = "set_cache_settings"
          + description  = "Homepage cache"
          + enabled      = true
          + expression   = "(http.host in {\"example1.com\" \"example2.com\"} and http.request.uri.path eq \"/\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = (known after apply)
          + version      = (known after apply)

          + action_parameters {
              + cache   = true
              + version = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudflare_ruleset.http_request_cache_settings: Creating...
cloudflare_ruleset.http_request_cache_settings: Creation complete after 2s [id=fa63a12876934da58f23cfe589382ca6]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
~/s/scratch$ terraform apply
cloudflare_ruleset.http_request_cache_settings: Refreshing state... [id=fa63a12876934da58f23cfe589382ca6]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```

</details>

you'll either need to find what has gone wrong in your state or track down what differs here for the repro as it looks to isolated to your setup.